
Какое будет выведено значение: let x = 5; alert( x++ ); ответ: 5

Чему равно такое выражение: [ ] + false - null + true; ответ: NaN

Что выведет этот код: let y = 1; let x = y = 2; alert(x); ответ: 2

Чему равна сумма [ ] + 1 + 2; ответ: 12

Что выведет этот код: alert( "1"[0] ); ответ: 1

Чему равно 2 && 1 && null && 0 && undefined; ответ: null 

Есть ли разница между выражениями? !!( a && b ) и (a && b); ответ: нет

Что выведет этот код: alert( null || 2 && 3 || 4 ); ответ: 3

a = [1, 2, 3]; b = [1, 2, 3]; Правда ли что a == b; ответ: не правда

Что выведет этот код: alert( +"Infinity" ); ответ: Infinity тип number

Верно ли сравнение: "ёжик" > "яблоко"; ответ: да 

Чему равно 0 || "" || 2 || undefined || true || falsе ; ответ: 2
